## Series

In [1]:
import pandas as pd
import numpy as np 
import warnings
warnings.filterwarnings('ignore')

In [2]:
# syntax for  series:- (data,index,dtype)

In [3]:
# Creating a empty series
a = pd.Series()
a

Series([], dtype: float64)

In [4]:
print(a)

Series([], dtype: float64)

In [5]:
# creating a series with Python list 
b = pd.Series(data = ['One','Two','Three','Four'])
b
# if you notice something bydefaultthe index values starts from "0".

0      One
1      Two
2    Three
3     Four
dtype: object

In [6]:
# lets change the index start from "1"
c = pd.Series(data=['one','two','three','four'],index=[1,2,3,4])
c

1      one
2      two
3    three
4     four
dtype: object

In [7]:
# alternate way to do with python list is to save it in a variable
list1 = ['one','two','three','four']
d = pd.Series(data=list1,index=[1,2,3,4])
d

1      one
2      two
3    three
4     four
dtype: object

In [8]:
list2 = ['five','four','three']
e = pd.Series(data = list2,index=[5,4,3])
e

5     five
4     four
3    three
dtype: object

In [11]:
# creating a series with python dict
dic = {1:'one',4:'two',3:'three'}
a = pd.Series(data=dic)
a
# As you know the dictionary is in key-value pair,
# here "key" become 'index'
# here "value" becomes "values"

1      one
4      two
3    three
dtype: object

In [12]:
dic = {1:'one',2:'two',3:'three'}
a = pd.Series(data = dic, index=[1,2,'C'])
a

1    one
2    two
C    NaN
dtype: object

In [13]:
# creating series with numpy array
i = np.array([1,2,3])
d = np.array(['one','two','three'])
a = pd.Series(data=d,index=i)
a

1      one
2      two
3    three
dtype: object

In [14]:
a = pd.Series(index=i,data=d)
a

1      one
2      two
3    three
dtype: object

In [16]:
a = pd.Series(d,i)
a

1      one
2      two
3    three
dtype: object

In [17]:
a = pd.Series(i,d)
a

one      1
two      2
three    3
dtype: int32

In [18]:
# creating a series with scalar value

a = pd.Series(5,index=[1,2,3,4,5])
a

1    5
2    5
3    5
4    5
5    5
dtype: int64

In [25]:
# creating a series with scalar value
a = pd.Series(5,index=np.arange(5))
a

0    5
1    5
2    5
3    5
4    5
dtype: int64

In [21]:
a = pd.Series(data = [12,25,45,87,69],index=np.arange(5))
a

0    12
1    25
2    45
3    87
4    69
dtype: int64

In [24]:
a = pd.Series(data = [12,25,45,87,69],index=np.arange(data.size))
a

NameError: name 'data' is not defined

## DataFrame

In [26]:
# Creating Empty DataFrame

df = pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

In [27]:
# Creating empty Df
df = pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [29]:
df.shape

(0, 0)

In [30]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 0 entries
Empty DataFrame

In [31]:
# creating df with Python List
data = ['one','two','three','four','five']
df = pd.DataFrame(data)
df

       0
0    one
1    two
2  three
3   four
4   five

In [33]:
data = ['one','two','three','four','five']
df = pd.DataFrame(data,index=[1,2,3,4,5])
df

       0
1    one
2    two
3  three
4   four
5   five

In [35]:
data = ['one','two','three','four','five']
df = pd.DataFrame(data,index=[1,2,3,4,5],columns=['col1'])
df

    col1
1    one
2    two
3  three
4   four
5   five

In [38]:
# Creating A dataset 

col = ['Name','Age','ML','Python']

data = [
    ['Rishi',20,76,80],
    ['Aditya',22,89,78],
    ['Sahil',21,78,89],
    ['Nishant',23,78,67],
    ['Sanjil',22,88,87]
]

df = pd.DataFrame(data,columns=col)
df

      Name  Age  ML  Python
0    Rishi   20  76      80
1   Aditya   22  89      78
2    Sahil   21  78      89
3  Nishant   23  78      67
4   Sanjil   22  88      87

In [39]:
df = pd.DataFrame(data = data, columns=col)
df

      Name  Age  ML  Python
0    Rishi   20  76      80
1   Aditya   22  89      78
2    Sahil   21  78      89
3  Nishant   23  78      67
4   Sanjil   22  88      87

In [42]:
# Providing Index
df = pd.DataFrame(data = data,index=['Rank1',
                                     'Rank2',
                                     'Rank3',
                                     'Rank4',
                                     'Rank5'],columns = col)
df

          Name  Age  ML  Python
Rank1    Rishi   20  76      80
Rank2   Aditya   22  89      78
Rank3    Sahil   21  78      89
Rank4  Nishant   23  78      67
Rank5   Sanjil   22  88      87

In [43]:
# Crreating Dataframe with Python Dictionary 

name = ["javed","ramachal","rajat","swapnil","rohit","prabhat","shweta","Sid","yuvi","siddu"]
age = [22,23,24,25,23,21,19,23,24,25]
ml = [67,78,67,78,89,90,87,67,45,89]
python =[89,78,65,67,78,67,56,57,89,78]

dic = {
    'Name':name,
    'Age':age,
    'ML':ml,
    'Python':python
}

df = pd.DataFrame(data = dic)
df

       Name  Age  ML  Python
0     javed   22  67      89
1  ramachal   23  78      78
2     rajat   24  67      65
3   swapnil   25  78      67
4     rohit   23  89      78
5   prabhat   21  90      67
6    shweta   19  87      56
7       Sid   23  67      57
8      yuvi   24  45      89
9     siddu   25  89      78

In [44]:
#Creating Df with Python Dictionary

name = ["javed","ramachal","rajat","swapnil","rohit","prabhat","shweta","Sid","yuvi","siddu"]
age = [22,23,24,25,23,21,19,23,24,25]
ml = [67,78,67,78,89,90,87,67,45,89]
python =[89,78,65,67,78,67,56,57,89,78]

dic = {
    'Name':name,
    'Age':age,
    'ML':ml,
    'Python':python
}


df = pd.DataFrame(data=dic,index=np.arange(1,11))
df

        Name  Age  ML  Python
1      javed   22  67      89
2   ramachal   23  78      78
3      rajat   24  67      65
4    swapnil   25  78      67
5      rohit   23  89      78
6    prabhat   21  90      67
7     shweta   19  87      56
8        Sid   23  67      57
9       yuvi   24  45      89
10     siddu   25  89      78

In [45]:
arr = np.arange(1,5).reshape(2,2)
arr

array([[1, 2],
       [3, 4]])

In [46]:
# Creating DataFrame with Numpy array

arr = np.arange(1,5).reshape(2,2)
df = pd.DataFrame(arr)
df

# bydefault it has taken 0,1 as index and column name also

   0  1
0  1  2
1  3  4

In [47]:
# lets assign column name to the above program
arr = np.arange(1,5).reshape(2,2)
df = pd.DataFrame(arr, columns=['Col1','Col2'])
df

   Col1  Col2
0     1     2
1     3     4

In [48]:
# lets assign index, column name to the above program
arr = np.arange(1,5).reshape(2,2)
df = pd.DataFrame(arr, index=[1,2] ,columns=['Col1','Col2'])
df

   Col1  Col2
1     1     2
2     3     4

In [49]:
# Creating dataframe with Series

d = {
    'one':pd.Series([1,2,3], index=['a','b','c']),
    'two':pd.Series(data=[1,2,3,4],index=['a','b','c','d'])
}

df = pd.DataFrame(d)
df

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

    Whenever there is "Nan" value in any column then the datatype of that column will get convert from 'int' to 'float'

In [50]:
d = {
    "one":pd.Series([1,2,3],index=["a","b","c"]),
    "two":pd.Series([1,2,3,4],index=["A","b","c","d"])
}

df = pd.DataFrame(d)
df

   one  two
A  NaN  1.0
a  1.0  NaN
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

    If you notice something on both the column there is Nan  values so both the column has datatype as "float"

In [51]:
#Creating df With Random
# np.random.randn(10,4) = 10 Rows and 4 Columns 
df = pd.DataFrame(np.random.randn(10,4),columns=['A','B','C','D'])
df

          A         B         C         D
0 -0.897039  0.190971  0.146130 -0.612714
1  0.037244  1.077565  0.203646  0.823913
2  1.109333  0.187029 -0.916933 -0.500486
3  1.469727  0.805344 -1.405840  0.855621
4 -0.011721  0.479878  0.590314 -0.361695
5  0.147109  2.389229  0.337561  1.168533
6 -1.274968 -0.287935 -0.708587  0.014881
7 -0.066382  1.041084 -0.576192  0.346199
8 -1.384553 -0.841499 -0.429042 -1.044582
9 -0.941091 -0.410720 -0.634556 -0.829912

In [53]:
#Creating df With Random
# np.random.randn(10,4) = 10 Rows and 4 Columns 
df = pd.DataFrame(np.random.randn(10,4),
                  index=np.arange(1,11),
                  columns=['A','B','C','D'])
df

           A         B         C         D
1  -0.899717  1.615963 -1.626262  0.743898
2   0.385547 -1.371484  1.096932  0.616503
3   0.186057 -0.436564  0.347159 -0.659687
4   1.563560 -1.132487  0.330350 -0.192337
5   1.034878 -0.982724 -0.738511 -0.181705
6   0.775518 -0.325717 -1.485145  0.832839
7  -0.228000  0.673633  0.754278 -0.139995
8   1.209501  0.380254  0.939121 -1.328492
9  -1.923683  0.494033  0.566479 -0.498061
10 -1.408433  0.998720 -0.430002  1.300650

## Panel

In [54]:
data = np.random.rand(2,4,5)
data
# 2 matrices
# 4 rows in each matrices
# 5 columns or 5 values in each rows

array([[[0.97278537, 0.72301919, 0.3481389 , 0.24467514, 0.62241009],
        [0.60298525, 0.20646812, 0.07192555, 0.02978768, 0.747553  ],
        [0.39844897, 0.90427179, 0.70572739, 0.00757585, 0.80551996],
        [0.22853704, 0.21798914, 0.7632939 , 0.49185168, 0.68833711]],

       [[0.08161361, 0.61381739, 0.84100083, 0.25835828, 0.89655665],
        [0.79564982, 0.37081312, 0.77257834, 0.45947136, 0.06853735],
        [0.18458432, 0.50297352, 0.65509454, 0.67291318, 0.14416073],
        [0.75456654, 0.71851001, 0.35982478, 0.7297982 , 0.93795586]]])

In [55]:
data.ndim

3

In [56]:
data = np.random.rand(2,4,5)
pan = pd.Panel(data)
pan

AttributeError: module 'pandas' has no attribute 'Panel'

In [57]:
data = np.random.rand(2,4,5)
p = pd.panel(data)
p

AttributeError: module 'pandas' has no attribute 'panel'